Revit 2024 API
BuiltInFailures.RoomFailures.OptionConflictRoomOverlapMain Property
 Option Conflict between Rooms.\nRoom in Option '[Option Name]' overlaps Room in the Main Model.\nTo resolve, select the Main Model Room and use the Add to Design Option Set command.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OptionConflictRoomOverlapMain { get; }
Visual Basic
Public Shared ReadOnly Property OptionConflictRoomOverlapMain As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OptionConflictRoomOverlapMain {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace